#+TITLE: Torsten: A Pharmacokinetic/Pharmacodynamic Model Library for Stan
#+SUBTITLE: User Manual @@latex:\\@@ @@html:<br>@@ (Torsten Version 0.88, Stan version 2.25.0)
#+LATEX_CLASS: amsbook
#+LATEX_CLASS_OPTIONS: [10pt, reqno, oneside]

# title page
#+LATEX_HEADER: \newcommand\subtitle[1]{\newcommand\mrgsubtitle{#1}}
#+LATEX_HEADER: \newcommand\mrgproject{Torsten}
#+LATEX_HEADER: \newcommand\mrgtitle{Torsten: A Pharmacokinetic/Pharmacodynamic Model Library for Stan}
#+LATEX_HEADER: \newcommand\mrgsubtitle{\Large{User Manual} \linebreak (Torsten Version 0.88, Stan version 2.25.0)}
#+LATEX_HEADER: \include{mrgtitlepage}

# make index
#+LATEX_HEADER: \usepackage{imakeidx}
#+LATEX_HEADER: \makeindex

#+LATEX_HEADER: \usepackage[letterpaper, width=6.5in, height=9in]{geometry}
#+LATEX_HEADER: \usepackage{graphicx}
#+LATEX_HEADER: \usepackage{pdfpages}
#+LATEX_HEADER: \usepackage{amssymb}
#+LATEX_HEADER: \usepackage{epstopdf}

# define MRG branding color
#+LATEX_HEADER: \usepackage{xcolor}
#+LATEX_HEADER: \definecolor{MRGGreen}{rgb}{0, 0.350, 0.200}
#+LATEX_HEADER: \usepackage[colorlinks=true, citecolor=MRGGreen, urlcolor=MRGGreen, linkcolor=MRGGreen]{hyperref}

#+LATEX_HEADER: \usepackage{bold-extra}
#+LATEX_HEADER: \usepackage{courier}
#+LATEX_HEADER: \usepackage{listings}
#+LATEX_HEADER: \usepackage{siunitx}
#+LATEX_HEADER: \usepackage{booktabs}
#+LATEX_HEADER: \usepackage[framemethod=TikZ, skipabove=10pt, skipbelow=10pt, backgroundcolor=black!5, roundcorner=4pt, linewidth=1pt]{mdframed}
#+LATEX_HEADER: \BeforeBeginEnvironment{minted}{\begin{mdframed}}
#+LATEX_HEADER: \AfterEndEnvironment{minted}{\end{mdframed}}

#+LATEX_HEADER: \usepackage{subcaption}

# remove "chapter" in chapter name
#+LATEX_HEADER: \renewcommand{\chaptername}{}
#+LATEX_HEADER: \numberwithin{equation}{chapter}
#+LATEX_HEADER: \numberwithin{figure}{chapter}
#+LATEX_HEADER: \numberwithin{table}{chapter}

#+LATEX_HEADER: \usepackage[section]{placeins}

#+LATEX_HEADER: \theoremstyle{remark}
** Two-compartment model for single patient 
  We model drug absorption in a single patient and simulate plasma drug concentrations:

  - Multiple Doses: 1250 mg, every 12 hours, for a total of 15 doses
  - PK measured at 0.083, 0.167, 0.25, 0.5, 0.75, 1, 1.5, 2, 4, 6,
    8, 10 and 12 hours after 1st, 2nd, and 15th dose. In addition, the
    PK is measured every 12 hours throughout the trial.

  With the plasma concentration $\hat{c}$ solved from
  two-compartment ODEs in [[sec:twocpt]], we simulate $c$ according to:
  \begin{align*}
    \log\left(c\right) &\sim N\left(\log\left(\widehat{c}\right),\sigma^2\right) \\
    \left(CL, Q, V_2, V_3, ka\right) &= \left(5\ {\rm L/h}, 8\  {\rm L/h}, 20\  {\rm L},  70\ {\rm L}, 1.2\ {\rm h^{-1}} \right) \\
    \sigma^2 &= 0.01
  \end{align*}
  The data are generated using the R package =mrgsolve= cite:Baron000.

Code below shows how Torsten function ~pmx_solve_twocpt~ can be used to fit the above model.

#+include: "../example-models/pk2cpt/pk2cpt.stan" :lines "5-74" src stan

#+BEGIN_SRC R :results output silent :exports none
  setwd("~/Work/Torsten_debug/example-models/R")
  source("TwoCpt.R")                      #
#+END_SRC

Three MCMC chains of 2000 iterations are simulated. The first
1000 iteration of each chain were discarded. Thus 1000 MCMC samples
per chain were used for the subsequent analyses.
The MCMC history plots(Figure [[twocpt_mcmc_history]])
suggest that the 3 chains have converged to common distributions for
all of the key model parameters. The fit to the plasma concentration
data (Figure [[twocpt_mcmc_predict]]) are in close agreement with the
data, which is not surprising since the fitted model is identical to
the one used to simulate the data. Similarly the parameter estimates
summarized in Table [[tab:twocpt_summary]] and Figure [[twocpt_mcmc_posterior]]
are consistent with the values used for simulation.

#+CAPTION: Summary of the MCMC simulations of the marginal posterior distribu- tions of the model parameters
#+NAME: tab:twocpt_summary
|-------+--------+---------+-------+--------+--------+--------+--------+--------+----------+------|
|       |   mean | se_mean |    sd |   2.5% |    25% |    50% |    75% |  97.5% |    n_eff | Rhat |
|-------+--------+---------+-------+--------+--------+--------+--------+--------+----------+------|
| CL    |  4.823 |   0.002 | 0.092 |  4.647 |  4.762 |  4.823 |  4.883 |  5.012 | 2392.155 | 1.00 |
| Q     |  7.596 |   0.013 | 0.586 |  6.479 |  7.201 |  7.594 |  7.977 |  8.785 | 1923.939 | 1.00 |
| V1    | 21.073 |   0.069 | 2.573 | 16.017 | 19.352 | 21.046 | 22.817 | 26.097 | 1385.883 | 1.00 |
| V2    | 76.365 |   0.105 | 5.611 | 65.805 | 72.623 | 76.172 | 79.916 | 87.971 | 2862.184 | 1.00 |
| ka    |  1.231 |   0.004 | 0.177 |  0.907 |  1.107 |  1.221 |  1.344 |  1.599 | 1581.825 | 1.00 |
| sigma |  0.109 |   0.000 | 0.012 |  0.089 |  0.100 |  0.108 |  0.116 |  0.134 | 2560.112 | 1.00 |
|-------+--------+---------+-------+--------+--------+--------+--------+--------+----------+------|
#+TBLFM: $2=$0;%0.3f::$3=$0;%0.3f::$4=$0;%0.3f::$5=$0;%0.3f::$6=$0;%0.3f::$7=$0;%0.3f::$8=$0;%0.3f::$9=$0;%0.3f::$10=$0;%0.3f::$11=$0;%0.3f

#+CAPTION: MCMC history plots for the parameters of a two compartment model with first order absorption (each color corresponds to a different chain)
#+NAME: twocpt_mcmc_history
#+ATTR_LATEX: :width 0.6\linewidth
[[../example-models/R/deliv/figure/TwoCptModel/TwoCptModelPlots001.pdf]]

#+CAPTION: MCMC history plots for the parameters of a two compartment model with first order absorption (each color corresponds to a different chain)
#+NAME: twocpt_mcmc_history
#+ATTR_LATEX: :width 0.6\linewidth
[[../example-models/R/deliv/figure/TwoCptModel/TwoCptModelPlots002.pdf]]

#+CAPTION: Posterior Marginal Densities of the Model Parameters of a two compartment model with first order absorption (each color corresponds to a different chain)
#+NAME: twocpt_mcmc_posterior
#+ATTR_LATEX: :width 0.6\linewidth
[[../example-models/R/deliv/figure/TwoCptModel/TwoCptModelPlots003.pdf]]

#+CAPTION: Predicted (posterior median and 90% credible intervals) and observed plasma drug concentrations of a two compartment model with first order absorption
#+NAME: twocpt_mcmc_predict
#+ATTR_LATEX: :width 0.5\linewidth
[[../example-models/R/deliv/figure/TwoCptModel/TwoCptModelPlots006.pdf]]

